{
  "en": {
    "translation": {
      "change language": "change language",
      "name": "Mohammed Katanani",
      "jobTitle": "Front-End Developer",
      "ABOUT ME": "ABOUT ME",
      "RESUME": "RESUME",
      "PROJECTS": "PROJECTS",
      "CONTACT": "CONTACT",
      "PORTFOLIO": "PORTFOLIO",
      "hello":"hello",
      "whoIAm":"Here's who I am & what I do",
      "resume":"resume",
      "projects":"projects",
      "PorjectsP":"Welcome to my top React projects page! Here you will find a selection of my most impactful work as a front-end developer. These projects showcase my skills in React.js and highlight my ability to deliver impressive outcomes. Although there are many more projects in my portfolio, I am proud to share these top projects with you. Thanks for visiting and please don't hesitate to reach out if you have any questions or would like to learn more about my experiences.",
      "discription":"Hello, and welcome to my portfolio! My name is Mohammed Katanani, and I'm a front-end developer skilled in React, Redux, HTML, CSS, and JavaScript. My portfolio showcases examples of my work in development and user experience. Let's collaborate! Please feel free to contact me with any questions or opportunities.",
      "UpworkP1":"Developed a clone of the Upwork platform using React functional components, styled components for a reusable UI library, and Redux for state management.",
      "UpworkP2":"Utilized JSON Server as a backend to simulate the API and database functionality.",
      "UpworkP3":"Implemented user authentication and authorization using JWT tokens .",
      "BrandP1":"Implemented seven pages for an e-commerce website with a design in Figma for buying and selling electronic goods.",
      "BrandP2":"Utilized styled components for building a UI library since everything can be in one file and easily be exported and reused .",
      "BrandP3":"Created two themes.",
      "BrandP4":"Applied responsive design principles to enhance website speed, accessibility, and ease of navigation.",
      "BrandP5":"Developed an application using functional components, simplifying the code and improving readability and maintainability.",
      "BrandP6":"Leveraged lazy loading and code splitting techniques to optimize resource utilization and improve application performance.",
      "PS-GameP1":"Analyzed and implemented Figma design, creating 3 pages.",
      "PS-GameP2":"Implement the private route and authentication to protect selected pages in a React app from unauthenticated users.",
      "PS-GameP3":"Integrated forms with actual APIs and tested them with Postman.",
      "PS-GameP4":"Developed the website using class components, which helped me gain a deeper understanding of the React lifecycle and how state and lifecycle methods are managed in React applications.",
      "RestaurantP1":"Integrated forms with actual APIs and tested them with Postman.",
      "RestaurantP2":"Coded 10 different sections including menu, about us, location, and contact.",
      "AdminP1":"Led a team of five developers in the creation of a website that offers reports and analytics.",
      "AdminP2":"Coordinated the project division and task distribution process using Jira.",
      "AdminP3":"Assigned tasks to team members and monitored progress to ensure timely completion.",
      "AdminP4":"Resulted in improved workflows and successful project outcomes.",
      "Education":"Education",
      "BachelorP1":"Bachelor of Computer Science, Al-Aqsa University",
      "BachelorP2":"GPA: 3.25 (as of of January 2023)",
      "FrontP1":"Front End with React | Gaza Sky Geeks",
      "Front-End":"Front-End",
      "Familiar with":"Familiar with",
      "Additional":"Additional"
    }
  }
}
